Repository: Yousha-dev/django-saas-backend-template
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: es

# auth.login.success
source: Login successful.
es: Inicio de sesión exitoso.

# auth.login.invalid_credentials
source: Invalid email or password.
es: Correo electrónico o contraseña inválidos.

# auth.register.success
source: Registration successful.
es: Registro exitoso.

# auth.register.email_exists
source: An account with this email already exists.
es: Ya existe una cuenta con este correo electrónico.

# auth.logout.success
source: Logout successful.
es: Cierre de sesión exitoso.

# auth.password_reset.success
source: Password reset email sent.
es: Correo de restablecimiento de contraseña enviado.

# auth.password_reset.invalid_token
source: Invalid or expired password reset token.
es: Token de restablecimiento de contraseña inválido o expirado.

# auth.email_verify.success
source: Email verified successfully.
es: Correo electrónico verificado exitosamente.

# auth.email_verify.invalid_token
source: Invalid or expired verification token.
es: Token de verificación inválido o expirado.

# subscription.created
source: Subscription created successfully.
es: Suscripción creada exitosamente.

source: Subscription cancelled.
es: Suscripción cancelada.

# subscription.renewed
source: Subscription renewed successfully.
es: Suscripción renovada exitosamente.

# subscription.expired
source: Your subscription has expired.
es: Su suscripción ha expirado.

# subscription.trial_started
source: Trial period has started.
es: El período de prueba ha comenzado.

# subscription.upgrade.success
source: Plan upgraded successfully.
es: Plan actualizado exitosamente.

# subscription.downgrade.success
source: Plan downgraded successfully.
es: Plan degradado exitosamente.

# payment.success
source: Payment processed successfully.
es: Pago procesado exitosamente.

# payment.failed
source: Payment failed. Please try again.
es: El pago falló. Por favor, inténtelo de nuevo.

# payment.refund.success
source: Refund processed successfully.
es: Reembolso procesado exitosamente.

# payment.refund.failed
source: Refund failed.
es: El reembolso falló.

# moderation.content_flagged
source: Content has been flagged for review.
es: El contenido ha sido marcado para revisión.

# moderation.content_approved
source: Content approved.
es: Contenido aprobado.

# moderation.content_rejected
source: Content has been rejected.
es: El contenido ha sido rechazado.

# moderation.appeal_submitted
source: Appeal submitted successfully.
es: Apelación enviada exitosamente.

# error.not_found
source: Resource not found.
es: Recurso no encontrado.

# error.permission_denied
source: You do not have permission to perform this action.
es: No tiene permiso para realizar esta acción.

# error.rate_limit
source: Too many requests. Please try again later.
es: Demasiadas solicitudes. Por favor, inténtelo más tarde.

# error.validation
source: Validation error.
es: Error de validación.

# error.server
source: An internal error occurred. Please try again later.
es: Ocurrió un error interno. Por favor, inténtelo más tarde.

# success.created
source: Resource created successfully.
es: Recurso creado exitosamente.

# success.updated
source: Resource updated successfully.
es: Recurso actualizado exitosamente.

# success.deleted
source: Resource deleted successfully.
es: Recurso eliminado exitosamente.
